---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ArrayFailures.ConstraintsNotSatisfied
source: html/dd38d5fb-fda5-2058-883d-57c920b4f69c.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ArrayFailures.ConstraintsNotSatisfied Property

Constraints are not satisfied

## Syntax (C#)
```csharp
public static FailureDefinitionId ConstraintsNotSatisfied { get; }
```